Pandas indexing Slicing

learn more - https://pandas.pydata.org/docs/user_guide/index.html

In [1]:
import pandas as pd
import numpy as np

In [2]:
dates = pd.date_range("20130101", periods=6)
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))
df

                   A         B         C         D
2013-01-01 -0.600872  0.851355 -1.349364  0.734940
2013-01-02  0.561708  1.515165  0.925047  1.433613
2013-01-03 -0.733515  2.389021  0.723264  0.229732
2013-01-04  1.334893  0.165959  0.613749 -0.102000
2013-01-05  1.210154 -0.262588 -0.470052  0.072072
2013-01-06 -1.799827 -0.672188 -0.442855 -0.189119

In [3]:
df.A

2013-01-01   -0.600872
2013-01-02    0.561708
2013-01-03   -0.733515
2013-01-04    1.334893
2013-01-05    1.210154
2013-01-06   -1.799827
Freq: D, Name: A, dtype: float64

In [4]:
df["A"]

2013-01-01   -0.600872
2013-01-02    0.561708
2013-01-03   -0.733515
2013-01-04    1.334893
2013-01-05    1.210154
2013-01-06   -1.799827
Freq: D, Name: A, dtype: float64

In [5]:
df[["A", "D"]]

                   A         D
2013-01-01 -0.600872  0.734940
2013-01-02  0.561708  1.433613
2013-01-03 -0.733515  0.229732
2013-01-04  1.334893 -0.102000
2013-01-05  1.210154  0.072072
2013-01-06 -1.799827 -0.189119

In [6]:
df[:3]

                   A         B         C         D
2013-01-01 -0.600872  0.851355 -1.349364  0.734940
2013-01-02  0.561708  1.515165  0.925047  1.433613
2013-01-03 -0.733515  2.389021  0.723264  0.229732

In [7]:
df["20130102":"20130104"]

                   A         B         C         D
2013-01-02  0.561708  1.515165  0.925047  1.433613
2013-01-03 -0.733515  2.389021  0.723264  0.229732
2013-01-04  1.334893  0.165959  0.613749 -0.102000

In [8]:
dates[0]

Timestamp('2013-01-01 00:00:00')

In [9]:
df.loc[dates[0]]

A   -0.600872
B    0.851355
C   -1.349364
D    0.734940
Name: 2013-01-01 00:00:00, dtype: float64

In [10]:
df.loc[:, ["A", "B"]]

                   A         B
2013-01-01 -0.600872  0.851355
2013-01-02  0.561708  1.515165
2013-01-03 -0.733515  2.389021
2013-01-04  1.334893  0.165959
2013-01-05  1.210154 -0.262588
2013-01-06 -1.799827 -0.672188

In [11]:
df.loc["20130102":"20130104", ["A", "D"]]

                   A         D
2013-01-02  0.561708  1.433613
2013-01-03 -0.733515  0.229732
2013-01-04  1.334893 -0.102000

In [12]:
df.loc[dates[0], "A"]

-0.6008715856797583

In [13]:
df.iloc[3]

A    1.334893
B    0.165959
C    0.613749
D   -0.102000
Name: 2013-01-04 00:00:00, dtype: float64

In [14]:
df.iloc[3:5, :2]

                   A         B
2013-01-04  1.334893  0.165959
2013-01-05  1.210154 -0.262588

In [15]:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02  0.561708  0.925047
2013-01-03 -0.733515  0.723264
2013-01-05  1.210154 -0.470052

In [16]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02  0.561708  1.515165  0.925047  1.433613
2013-01-03 -0.733515  2.389021  0.723264  0.229732

In [17]:
df.iloc[:, 1:3]

                   B         C
2013-01-01  0.851355 -1.349364
2013-01-02  1.515165  0.925047
2013-01-03  2.389021  0.723264
2013-01-04  0.165959  0.613749
2013-01-05 -0.262588 -0.470052
2013-01-06 -0.672188 -0.442855

In [18]:
df.iloc[1, 1]

1.515165338925176

In [19]:
df["A"] > 0.5

2013-01-01    False
2013-01-02     True
2013-01-03    False
2013-01-04     True
2013-01-05     True
2013-01-06    False
Freq: D, Name: A, dtype: bool

In [20]:
df[df["A"] > 0.2]

                   A         B         C         D
2013-01-02  0.561708  1.515165  0.925047  1.433613
2013-01-04  1.334893  0.165959  0.613749 -0.102000
2013-01-05  1.210154 -0.262588 -0.470052  0.072072

In [21]:
df[df > 0]

                   A         B         C         D
2013-01-01       NaN  0.851355       NaN  0.734940
2013-01-02  0.561708  1.515165  0.925047  1.433613
2013-01-03       NaN  2.389021  0.723264  0.229732
2013-01-04  1.334893  0.165959  0.613749       NaN
2013-01-05  1.210154       NaN       NaN  0.072072
2013-01-06       NaN       NaN       NaN       NaN